/*
Сдать решение задачи C6-Сколько зерен
Сколько зерен на доске
Когда создатель шахмат, древнеиндийский мудрец и математик Сисса бен Дахир,
показал своё изобретение Правителю страны, тому так понравилась игра, что
он позволил изобретателю право самому выбрать награду.
 Мудрец попросил у Повелителя за первую клетку шахматной доски заплатить
 ему одно зерно риса, за второе — два, за третье — четыре и т. д., удваивая
 количество зёрен на каждой следующей клетке. Помоги повелителю сосчитать
 сколько зерен на какой клетке лежит.
Необходимо составить функцию, которая определяет, сколько зерен попросил
положить на N-ую клетку изобретатель шахмат
(на 1-ую – 1 зерно, на 2-ую – 2 зерна, на 3-ю – 4 зерна, …)

Формат входных данных
Цлое число от 1 до 64
Формат результата
Одно целое число. Количество зерен на данной клетке.
*/

#include <stdio.h>  // подключаем заголовочный файл stdio.h
#include <stdint.h> // полключение заголовочного файла типы переменных.
// #include <math.h>						// подключаем заголовочный файл математических функций
uint64_t FuncF(int x)
{
    return (uint64_t)1 << (x - 1); // Возводим в степень

}

int main(void) // определяем функцию main
{
    int X; // Обявляем переменные
    if (scanf("%d", &X) != 1 || X < 1 || X > 64)
    {                            // Принимаем число, проверяем что оно от 1 до 64
        printf("Error input\n"); // Если не соответсвует -выводим ошибку.
        return 0;
    };
    printf("%llu\n", FuncF(X));
    return 0; // выходим из функции
} // конец функции
